In [2]:
import pandas as pd

In [3]:
data = {
    "name": ["A", "B", "C", "D"],
    "marks": [99, 94, 91, 98],
    "age": [14, 15, 13, 15]
}

In [4]:
df = pd.DataFrame(data)
df

  name  marks  age
0    A     99   14
1    B     94   15
2    C     91   13
3    D     98   15

In [5]:
type(df.name)

pandas.core.series.Series

In [6]:
df["marks"][0]

99

In [7]:
df.index = ["I", "II", "III", "IV"]

In [8]:
df.head(3)

    name  marks  age
I      A     99   14
II     B     94   15
III    C     91   13

In [9]:
df.count()

name     4
marks    4
age      4
dtype: int64

In [10]:
listDict = [{ "a": 10, "b": 5 }, { "a": 4 , "b": 5, "c": 3}]
newDf = pd.DataFrame(listDict)
newDf

    a  b    c
0  10  5  NaN
1   4  5  3.0

In [11]:
newDf.index = ["maths", "english"]
newDf

          a  b    c
maths    10  5  NaN
english   4  5  3.0

In [12]:
newDf["d"] = [2, 11]
newDf

          a  b    c   d
maths    10  5  NaN   2
english   4  5  3.0  11

In [13]:
newDf.loc["science"] = [3, 6, 8, 1]
newDf

          a  b    c   d
maths    10  5  NaN   2
english   4  5  3.0  11
science   3  6  8.0   1

In [14]:
df[: ] = 0
df

/var/folders/qc/lc52z8ts75b0mh7w3ywzhwym0000gn/T/ipykernel_49093/2282815763.py:1: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df[: ] = 0

     name  marks  age
I       0      0    0
II      0      0    0
III     0      0    0
IV      0      0    0

In [15]:
newDf.drop("maths")

         a  b    c   d
english  4  5  3.0  11
science  3  6  8.0   1

In [16]:
newDf.loc["maths"] = [2, 4, 11, 8]
newDf

         a  b     c   d
maths    2  4  11.0   8
english  4  5   3.0  11
science  3  6   8.0   1

In [17]:
newDf.drop("d", axis=1)

         a  b     c
maths    2  4  11.0
english  4  5   3.0
science  3  6   8.0

In [18]:
newDf.rename({"science": "sst"})

         a  b     c   d
maths    2  4  11.0   8
english  4  5   3.0  11
sst      3  6   8.0   1

In [19]:
newDf.rename({"d": "e"}, axis="columns")

         a  b     c   e
maths    2  4  11.0   8
english  4  5   3.0  11
science  3  6   8.0   1

In [20]:
newDf.loc[:,"b"]

maths      4
english    5
science    6
Name: b, dtype: int64

In [21]:
newDf.loc["maths"] > 5

a    False
b    False
c     True
d     True
Name: maths, dtype: bool

In [22]:
newDf["a"]

maths      2
english    4
science    3
Name: a, dtype: int64

In [23]:
newDf.loc[[True, False, True]]

         a  b     c  d
maths    2  4  11.0  8
science  3  6   8.0  1

In [24]:
newDf.append(df)

/var/folders/qc/lc52z8ts75b0mh7w3ywzhwym0000gn/T/ipykernel_49093/3222836611.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  newDf.append(df)

           a    b     c     d  name  marks  age
maths    2.0  4.0  11.0   8.0   NaN    NaN  NaN
english  4.0  5.0   3.0  11.0   NaN    NaN  NaN
science  3.0  6.0   8.0   1.0   NaN    NaN  NaN
I        NaN  NaN   NaN   NaN   0.0    0.0  0.0
II       NaN  NaN   NaN   NaN   0.0    0.0  0.0
III      NaN  NaN   NaN   NaN   0.0    0.0  0.0
IV       NaN  NaN   NaN   NaN   0.0    0.0  0.0

In [25]:
csvDf = pd.read_csv("./main.csv", sep="\t", header=0)
csvDf

   Roll No name  marks
0        1    a      3
1        2    b      8
2        3    c      6
3        4    d     11

In [26]:
newDf.to_csv(path_or_buf="./new.csv", sep=",")